app/Models/Arsip_model.php

SELECT *
FROM `tbl_arsip`
LEFT JOIN `tbl_departemen` ON `tbl_departemen`.`id_departemen` = `tbl_arsip`.`id_departemen`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_arsip`.`id_kategori`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `tbl_arsip`.`id_user`
ORDER BY `id_arsip` DESC
---
        public function tampil(){
                return $this->db->table('tbl_arsip')
                ->join('tbl_departemen', 'tbl_departemen.id_departemen = tbl_arsip.id_departemen', 'left')
                ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_arsip.id_kategori','left')
                ->join('tbl_user', 'tbl_user.id_user = tbl_arsip.id_user','left')
                ->orderBy('id_arsip', 'desc')->get()->getResultArray();

SELECT *
FROM `tbl_arsip`
LEFT JOIN `tbl_departemen` ON `tbl_departemen`.`id_departemen` = `tbl_arsip`.`id_departemen`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_arsip`.`id_kategori`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `tbl_arsip`.`id_user`
WHERE `id_arsip` = '3'
---
        public function detail($id_arsip){
                return $this->db->table('tbl_arsip')
                ->join('tbl_departemen', 'tbl_departemen.id_departemen = tbl_arsip.id_departemen', 'left')
                ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_arsip.id_kategori','left')
                ->join('tbl_user', 'tbl_user.id_user = tbl_arsip.id_user','left')
                ->where('id_arsip', $id_arsip)->get()->getRowArray();