app/Models/Auth_model.php

        public function login($username, $password){
                return $this->db->table('tbl_user')->where([
                        'username' => $username,
                        'password' => $password
                ])->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'amandasari223@gmail.com'
AND `password` = 'admin123'