app/Models/Departemen_model.php

SELECT *
FROM `tbl_departemen`
---
        public function tampil(){
                return $this->db->table('tbl_departemen')->get()->getResultArray();