app/Models/Home_model.php

        public function totalarsip(){
                return $this->db->table('tbl_arsip')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_arsip`

        public function totalkategori(){
                return $this->db->table('tbl_kategori')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_kategori`

        public function totaldep(){
                return $this->db->table('tbl_departemen')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_departemen`

        public function totaluser(){
                return $this->db->table('tbl_user')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_user`