app/Models/Kategori_model.php

        public function tampil(){
                return $this->db->table('tbl_kategori')->get()->getResultArray();
---
SELECT *
FROM `tbl_kategori`