app/Models/M_user.php

        public function tampil(){
                return $this->db->table('tbl_user')
                ->join('tbl_departemen', 'tbl_departemen.id_departemen = tbl_user.id_departemen', 'left')
                ->orderBy('id_user', 'desc')->get()->getResultArray();
---
SELECT *
FROM `tbl_user`
LEFT JOIN `tbl_departemen` ON `tbl_departemen`.`id_departemen` = `tbl_user`.`id_departemen`
ORDER BY `id_user` DESC